konf/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>фл_ПодсветитьСтроку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

konf/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		
		
		ТЗ_Отпуск = ОтпускаСотрудников.Выгрузить(,"Сотрудник, КолВоДней");
		ТЗ_Отпуск.Свернуть("Сотрудник","КолВоДней");
		
		Для Каждого СтрокаТЗ Из ТЗ_Отпуск Цикл   
			
			Движение = Движения.ВКМ_ОтпускаСотрудников.ДобавитьПриход();
			
			Движение.Год = НачалоГода(Год);
			Движение.Период = НачалоГода(Год);
			Движение.Сотрудник = СтрокаТЗ.Сотрудник;
			Движение.ДнейОтпуска = СтрокаТЗ.КолВоДней;
			
		КонецЦикла; 
		
		Движения.ВКМ_ОтпускаСотрудников.Записать(Истина);
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		
		Отбор = Новый Структура;
		Отбор.Вставить("фл_ПодсветитьСтроку", Истина);
		
		НайденныеСтроки = ОтпускаСотрудников.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			Сотрудник = Неопределено;
			Для Каждого Строка Из НайденныеСтроки Цикл	
				Если Строка.Сотрудник <> Сотрудник Тогда
					Сотрудник = Строка.Сотрудник;
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для сотрудника %1 указано кол-во дней отпуска больше 28 дней", Сотрудник));
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЦикла;    
			Отказ = Истина;
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
		
		
		Ответственный = Пользователи.ТекущийПользователь();
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
